spec/vcr_cassettes/controllers/subscriptions/reactivate_success.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_AV8QGNjX4RE1j0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.1
      Authorization:
      - Bearer sk_test_uGgeLv9tiR6pziNZhS6G2jGw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.1","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andres-AC-MBP.local 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33
        PST 2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"Andres-AC-MBP.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 21 Apr 2017 01:44:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4362'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AVsawPfqXVJzYL
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AV8QGNjX4RE1j0",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [
              {
                "id": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "63755",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AV8QGNjX4RE1j0",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 2,
                "exp_year": 2018,
                "fingerprint": "4T6V5R0sArpHESsJ",
                "funding": "credit",
                "last4": "0077",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/cards"
          },
          "created": 1492567354,
          "currency": "usd",
          "default_card": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
          "default_source": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "naomie_turcotte@frami.co",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "63755",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AV8QGNjX4RE1j0",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 2,
                "exp_year": 2018,
                "fingerprint": "4T6V5R0sArpHESsJ",
                "funding": "credit",
                "last4": "0077",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_AV8Qtgp2i2g8Bt",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": true,
                "canceled_at": 1492739085,
                "created": 1492567358,
                "current_period_end": 1493172158,
                "current_period_start": 1492567358,
                "customer": "cus_AV8QGNjX4RE1j0",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1AA89S4Pf3BKBRGPhgq6joL7",
                      "object": "subscription_item",
                      "created": 1492567359,
                      "plan": {
                        "id": "standard",
                        "object": "plan",
                        "amount": 1395,
                        "created": 1483053699,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Standard",
                        "statement_descriptor": null,
                        "trial_period_days": 7,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_AV8Qtgp2i2g8Bt"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "standard",
                  "object": "plan",
                  "amount": 1395,
                  "created": 1483053699,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Standard",
                  "statement_descriptor": null,
                  "trial_period_days": 7,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1492567358,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1493172158,
                "trial_start": 1492567358
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 21 Apr 2017 01:44:58 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_AV8QGNjX4RE1j0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.1
      Authorization:
      - Bearer sk_test_uGgeLv9tiR6pziNZhS6G2jGw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.1","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andres-AC-MBP.local 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33
        PST 2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"Andres-AC-MBP.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 21 Apr 2017 01:44:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4362'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AVsauNiPWVArx8
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AV8QGNjX4RE1j0",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [
              {
                "id": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "63755",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AV8QGNjX4RE1j0",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 2,
                "exp_year": 2018,
                "fingerprint": "4T6V5R0sArpHESsJ",
                "funding": "credit",
                "last4": "0077",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/cards"
          },
          "created": 1492567354,
          "currency": "usd",
          "default_card": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
          "default_source": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "naomie_turcotte@frami.co",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "63755",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AV8QGNjX4RE1j0",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 2,
                "exp_year": 2018,
                "fingerprint": "4T6V5R0sArpHESsJ",
                "funding": "credit",
                "last4": "0077",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_AV8Qtgp2i2g8Bt",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": true,
                "canceled_at": 1492739085,
                "created": 1492567358,
                "current_period_end": 1493172158,
                "current_period_start": 1492567358,
                "customer": "cus_AV8QGNjX4RE1j0",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1AA89S4Pf3BKBRGPhgq6joL7",
                      "object": "subscription_item",
                      "created": 1492567359,
                      "plan": {
                        "id": "standard",
                        "object": "plan",
                        "amount": 1395,
                        "created": 1483053699,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Standard",
                        "statement_descriptor": null,
                        "trial_period_days": 7,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_AV8Qtgp2i2g8Bt"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "standard",
                  "object": "plan",
                  "amount": 1395,
                  "created": 1483053699,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Standard",
                  "statement_descriptor": null,
                  "trial_period_days": 7,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1492567358,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1493172158,
                "trial_start": 1492567358
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 21 Apr 2017 01:44:58 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions/sub_AV8Qtgp2i2g8Bt
    body:
      encoding: UTF-8
      string: plan=standard
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.1
      Authorization:
      - Bearer sk_test_uGgeLv9tiR6pziNZhS6G2jGw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.1","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andres-AC-MBP.local 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33
        PST 2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"Andres-AC-MBP.local"}'
      Content-Length:
      - '13'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 21 Apr 2017 01:44:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1614'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AVsagSUDKjNVnA
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_AV8Qtgp2i2g8Bt",
          "object": "subscription",
          "application_fee_percent": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1492567358,
          "current_period_end": 1493172158,
          "current_period_start": 1492567358,
          "customer": "cus_AV8QGNjX4RE1j0",
          "discount": null,
          "ended_at": null,
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_1AA89S4Pf3BKBRGPhgq6joL7",
                "object": "subscription_item",
                "created": 1492567359,
                "plan": {
                  "id": "standard",
                  "object": "plan",
                  "amount": 1395,
                  "created": 1483053699,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Standard",
                  "statement_descriptor": null,
                  "trial_period_days": 7,
                  "statement_description": null
                },
                "quantity": 1
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_AV8Qtgp2i2g8Bt"
          },
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "standard",
            "object": "plan",
            "amount": 1395,
            "created": 1483053699,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Standard",
            "statement_descriptor": null,
            "trial_period_days": 7,
            "statement_description": null
          },
          "quantity": 1,
          "start": 1492567358,
          "status": "trialing",
          "tax_percent": null,
          "trial_end": 1493172158,
          "trial_start": 1492567358
        }
    http_version: 
  recorded_at: Fri, 21 Apr 2017 01:44:59 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_AV8QGNjX4RE1j0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.1
      Authorization:
      - Bearer sk_test_uGgeLv9tiR6pziNZhS6G2jGw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.1","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andres-AC-MBP.local 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33
        PST 2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"Andres-AC-MBP.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 21 Apr 2017 01:44:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4357'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AVsaafcyjY4zAt
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AV8QGNjX4RE1j0",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [
              {
                "id": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "63755",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AV8QGNjX4RE1j0",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 2,
                "exp_year": 2018,
                "fingerprint": "4T6V5R0sArpHESsJ",
                "funding": "credit",
                "last4": "0077",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/cards"
          },
          "created": 1492567354,
          "currency": "usd",
          "default_card": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
          "default_source": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "naomie_turcotte@frami.co",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1AA89Q4Pf3BKBRGP3eNH9BcK",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "63755",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AV8QGNjX4RE1j0",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 2,
                "exp_year": 2018,
                "fingerprint": "4T6V5R0sArpHESsJ",
                "funding": "credit",
                "last4": "0077",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_AV8Qtgp2i2g8Bt",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1492567358,
                "current_period_end": 1493172158,
                "current_period_start": 1492567358,
                "customer": "cus_AV8QGNjX4RE1j0",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1AA89S4Pf3BKBRGPhgq6joL7",
                      "object": "subscription_item",
                      "created": 1492567359,
                      "plan": {
                        "id": "standard",
                        "object": "plan",
                        "amount": 1395,
                        "created": 1483053699,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Standard",
                        "statement_descriptor": null,
                        "trial_period_days": 7,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_AV8Qtgp2i2g8Bt"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "standard",
                  "object": "plan",
                  "amount": 1395,
                  "created": 1483053699,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Standard",
                  "statement_descriptor": null,
                  "trial_period_days": 7,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1492567358,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1493172158,
                "trial_start": 1492567358
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AV8QGNjX4RE1j0/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 21 Apr 2017 01:44:59 GMT
recorded_with: VCR 3.0.3
