spec/vcr_cassettes/controllers/subscriptions/reactivate_failure.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_APuk2Rg1xJKvU8
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.1
      Authorization:
      - Bearer sk_test_uGgeLv9tiR6pziNZhS6G2jGw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.1","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andres-AC-MBP.local 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33
        PST 2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"Andres-AC-MBP.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 21 Apr 2017 01:46:08 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4351'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AVsba1GAOZVIpx
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_APuk2Rg1xJKvU8",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [
              {
                "id": "card_1A54vR4Pf3BKBRGP4dkdveDz",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_APuk2Rg1xJKvU8",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 10,
                "exp_year": 2017,
                "fingerprint": "FpDZIKE73Z8Qd25P",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_APuk2Rg1xJKvU8/cards"
          },
          "created": 1491363317,
          "currency": "usd",
          "default_card": "card_1A54vR4Pf3BKBRGP4dkdveDz",
          "default_source": "card_1A54vR4Pf3BKBRGP4dkdveDz",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "glenna.thiel@robelkohler.biz",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1A54vR4Pf3BKBRGP4dkdveDz",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_APuk2Rg1xJKvU8",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 10,
                "exp_year": 2017,
                "fingerprint": "FpDZIKE73Z8Qd25P",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_APuk2Rg1xJKvU8/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_APuk0yoLqOT5I3",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1491363319,
                "current_period_end": 1494560119,
                "current_period_start": 1491968119,
                "customer": "cus_APuk2Rg1xJKvU8",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1A54vT4Pf3BKBRGPcskfqLWN",
                      "object": "subscription_item",
                      "created": 1491363319,
                      "plan": {
                        "id": "standard",
                        "object": "plan",
                        "amount": 1395,
                        "created": 1483053699,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Standard",
                        "statement_descriptor": null,
                        "trial_period_days": 7,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_APuk0yoLqOT5I3"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "standard",
                  "object": "plan",
                  "amount": 1395,
                  "created": 1483053699,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Standard",
                  "statement_descriptor": null,
                  "trial_period_days": 7,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1491363319,
                "status": "active",
                "tax_percent": null,
                "trial_end": 1491968119,
                "trial_start": 1491363319
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_APuk2Rg1xJKvU8/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 21 Apr 2017 01:46:08 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_APuk2Rg1xJKvU8
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.1
      Authorization:
      - Bearer sk_test_uGgeLv9tiR6pziNZhS6G2jGw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.1","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andres-AC-MBP.local 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33
        PST 2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"Andres-AC-MBP.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 21 Apr 2017 01:46:08 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4351'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AVsb1nEvz876jY
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_APuk2Rg1xJKvU8",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [
              {
                "id": "card_1A54vR4Pf3BKBRGP4dkdveDz",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_APuk2Rg1xJKvU8",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 10,
                "exp_year": 2017,
                "fingerprint": "FpDZIKE73Z8Qd25P",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_APuk2Rg1xJKvU8/cards"
          },
          "created": 1491363317,
          "currency": "usd",
          "default_card": "card_1A54vR4Pf3BKBRGP4dkdveDz",
          "default_source": "card_1A54vR4Pf3BKBRGP4dkdveDz",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "glenna.thiel@robelkohler.biz",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1A54vR4Pf3BKBRGP4dkdveDz",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_APuk2Rg1xJKvU8",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 10,
                "exp_year": 2017,
                "fingerprint": "FpDZIKE73Z8Qd25P",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_APuk2Rg1xJKvU8/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_APuk0yoLqOT5I3",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1491363319,
                "current_period_end": 1494560119,
                "current_period_start": 1491968119,
                "customer": "cus_APuk2Rg1xJKvU8",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1A54vT4Pf3BKBRGPcskfqLWN",
                      "object": "subscription_item",
                      "created": 1491363319,
                      "plan": {
                        "id": "standard",
                        "object": "plan",
                        "amount": 1395,
                        "created": 1483053699,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Standard",
                        "statement_descriptor": null,
                        "trial_period_days": 7,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_APuk0yoLqOT5I3"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "standard",
                  "object": "plan",
                  "amount": 1395,
                  "created": 1483053699,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Standard",
                  "statement_descriptor": null,
                  "trial_period_days": 7,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1491363319,
                "status": "active",
                "tax_percent": null,
                "trial_end": 1491968119,
                "trial_start": 1491363319
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_APuk2Rg1xJKvU8/subscriptions"
          }
        }
    http_version: 
  recorded_at: Fri, 21 Apr 2017 01:46:08 GMT
recorded_with: VCR 3.0.3
